Revit 2027 API
Category.IsTagCategory Property
 Identifies if the category is associated with a type of tag for a different category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTagCategory { get; }
Public ReadOnly Property IsTagCategory As Boolean
	Get
public:
property bool IsTagCategory {
	bool get ();
}
member IsTagCategory : bool with get
Property Value
Boolean
 True if the category is associated with a type of tag for a different category, false if not.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace